app/Controllers/Admin.php

    public function index()
    {
        //$Admin = $this->umkmdataModel->findAll();
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $umkm = $this->umkmdataModel->search($keyword);
        } else {
            $umkm = $this->umkmdataModel->orderBy('id', 'DESC');
        }

        $data = [
            'tittle' => "Data List",
            'umkmdata' => $umkm->findAll(),
            // 'umkmdata' => $umkm->paginate(50, 'umkmdata'),
            // 'pager' => $this->umkmdataModel->pager
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
SELECT *
FROM `umkmdata`
ORDER BY `id` DESC
 LIMIT 50

            "akunnib" => $this->request->getPost('akunnib'),
            "akunhalal" => $this->request->getPost('akunhalal'),
        ];
        $this->umkmdataModel->insert($data);
---
INSERT INTO `umkmdata` (`tanggal`, `nik`, `nama`, `kelamin`, `alamat`, `kelurahan`, `kecamatan`, `kota`, `kodepos`, `merek`, `produk1`, `produk2`, `produk3`, `produk4`, `akunnib`, `akunhalal`) VALUES ('2023-08-19', '1234567890123456', 'asas', 'Wanita', 'ssa', 'sasa', 'sa', 'sas', '123', 'asas', 'sas', '', '', '', 'Belum', 'Sudah')