app/Controllers/Home.php

SELECT *
FROM `umkmdata`
SELECT COUNT(*) AS `numrows` FROM `umkmdata`
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunnib` = 'double'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunnib` = 'tidak bisa dilanjut'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunnib` = 'belum'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunnib` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunhalal` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunhalal` = 'tidak bisa dilanjut'
SELECT COUNT(*) AS `numrows`
FROM `umkmdata`
WHERE `akunhalal` = 'belum'
SELECT COUNT(id) AS jumlah, `kecamatan`
FROM `umkmdata`
GROUP BY `kecamatan`
---
    public function index()
    {
        $umkmdata = $this->umkmdataModel->findAll();
        $jumlah_baris = $this->umkmdataModel->countAll(); // Menghitung jumlah baris pada tabel
        $jumlah_double = $this->umkmdataModel->where('akunnib', 'double')->countAllResults();

        // Menghitung jumlah kolom akun nib
        $jumlah_selesai = $this->umkmdataModel->where('akunnib', 'selesai')->countAllResults();
        $jumlah_tidaklanjut = $this->umkmdataModel->where('akunnib', 'tidak bisa dilanjut')->countAllResults();
        $jumlah_belum = $this->umkmdataModel->where('akunnib', 'belum')->countAllResults();
        $jumlah_sudah = $this->umkmdataModel->where('akunnib', 'sudah')->countAllResults();

        // Menghitung jumlah kolom akun halal
        $jumlah_selesai2 = $this->umkmdataModel->where('akunhalal', 'selesai')->countAllResults();
        $jumlah_tidaklanjut2 = $this->umkmdataModel->where('akunhalal', 'tidak bisa dilanjut')->countAllResults();
        $jumlah_belum2 = $this->umkmdataModel->where('akunhalal', 'belum')->countAllResults();
        $jumlah_sudah2 = $this->umkmdataModel->where('akunhalal', 'sudah')->countAllResults();

        $hasil_pengurangan = $jumlah_baris - $jumlah_double;



        $jumlah_per_kecamatan = $this->umkmdataModel->select('COUNT(id) AS jumlah, kecamatan')
        ->groupBy('kecamatan')
        ->findAll();

        $jumlah_per_jnsklmn = $this->umkmdataModel->select('COUNT(id) AS jumlah, kelamin')
        ->groupBy('kelamin')
        ->findAll();