app/Models/UmkmDataModel.php

    public function getUmkmData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }

        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `umkmdata`
WHERE `id` = '618'
 LIMIT 1